/* REXX PROGRAM FOR TESTING GDDM INPUT */
/* PROGRAM BY MACIEKSOFT */
ADDRESS LINK 'GDDMREXX INIT' /* INITIALIZE GDDM */
ADDRESS GDDM /* WE ARE TALKING TO GDDM */
TXTF = 'HELLO GDDM WORLD! THIS IS GDDM INPUT TEST REXX EXEC'; TXTL = LENGTH(TXTF)
'ASDFLD 1 2 4 1 60 2' /* FIELD1, ROW2, COL4, DEPTH1, WIDTH60, TYPE2 (PROTECTED) */
'ASCPUT 1 .TXTL .TXTF' /* SEND TEXT TO FIELD 1 */
'ASFCOL 1 4' /* SET FIELD1 COLOR TO GREEN (4) */
TXTF = 'INPUT SOME TEXT ->>>'; TXTL = LENGTH(TXTF)
'ASDFLD 2 4 4 1 20 2' /* FIELD2, ROW4, COL4, DEPTH1, WIDTH21, TYPE2 */
'ASCPUT 2 .TXTL .TXTF' /* SEND TEXT TO FIELD 2 */
'ASFCOL 2 4' /* SET FIELD2 COLOR TO GREEN */
/* ---------------------------------- */
'ASDFLD 3 4 25 1 12 1' /* FIELD3, ROW4, COL25, DEPTH1, WIDTH12, TYPE1 (INPUT) */
'ASFCOL 3 2' /* FIELD3 GONNA BE RED */
'ASFCUR 3 1 1' /* WE POSITION CURSOR AT THE BEGINNING OF FIELD 3 */
'ASREAD . . .' /* SEND TO TERMINAL AFTER PRESSING ENTER */
'ASCGET 3 12 .INTX' /* GET TEXT FROM FIELD 3 AND PUT INTO VARIABLE */
INTX2 = 'DATA FROM FIELD 3:' INTX /* WE DEFINE VARIABLE INTX2 */
'ASCPUT 1 60 .INTX2' /* PUT TEXT IN A FIELD 1 */
'ASREAD . . .' /* WAIT UNTIL OPERATOR PRESSES ENTER TO TERMINATE GDDM */
ADDRESS LINK 'GDDMREXX TERM' /* TERMINATE GDDM */
EXIT